senaalwa/HelberBoard/boards.txt
menu.UploadSpeed=Upload Speed
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level

##############################################################
### DO NOT PUT BOARDS ABOVE THE OFFICIAL ESPRESSIF BOARDS! ###
##############################################################

helber-learningboard.name=Helber Board

helber-learningboard.upload.tool=esptool_py
helber-learningboard.upload.maximum_size=1310720
helber-learningboard.upload.maximum_data_size=327680
helber-learningboard.upload.wait_for_upload_port=true

helber-learningboard.serial.disableDTR=true
helber-learningboard.serial.disableRTS=true

helber-learningboard.build.mcu=esp32
helber-learningboard.build.core=esp32
helber-learningboard.build.variant=helber-learningboard
helber-learningboard.build.board=helber-learningboard

helber-learningboard.build.f_cpu=240000000L
helber-learningboard.build.flash_size=4MB
helber-learningboard.build.flash_freq=40m
helber-learningboard.build.flash_mode=dio
helber-learningboard.build.boot=dio
helber-learningboard.build.partitions=default
helber-learningboard.build.defines=

helber-learningboard.menu.PSRAM.disabled=Disabled
helber-learningboard.menu.PSRAM.disabled.build.defines=
helber-learningboard.menu.PSRAM.disabled.build.extra_libs=
helber-learningboard.menu.PSRAM.enabled=Enabled
helber-learningboard.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue
helber-learningboard.menu.PSRAM.enabled.build.extra_libs=-lc-psram-workaround -lm-psram-workaround

helber-learningboard.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
helber-learningboard.menu.PartitionScheme.default.build.partitions=default
helber-learningboard.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
helber-learningboard.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
helber-learningboard.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
helber-learningboard.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
helber-learningboard.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
helber-learningboard.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
helber-learningboard.menu.PartitionScheme.minimal.build.partitions=minimal
helber-learningboard.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
helber-learningboard.menu.PartitionScheme.no_ota.build.partitions=no_ota
helber-learningboard.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
helber-learningboard.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
helber-learningboard.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
helber-learningboard.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
helber-learningboard.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
helber-learningboard.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
helber-learningboard.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
helber-learningboard.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
helber-learningboard.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
helber-learningboard.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
helber-learningboard.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
helber-learningboard.menu.PartitionScheme.huge_app.build.partitions=huge_app
helber-learningboard.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
helber-learningboard.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
helber-learningboard.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
helber-learningboard.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
helber-learningboard.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
helber-learningboard.menu.PartitionScheme.fatflash.build.partitions=ffat
helber-learningboard.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
helber-learningboard.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
helber-learningboard.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
helber-learningboard.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

helber-learningboard.menu.CPUFreq.240=240MHz (WiFi/BT)
helber-learningboard.menu.CPUFreq.240.build.f_cpu=240000000L
helber-learningboard.menu.CPUFreq.160=160MHz (WiFi/BT)
helber-learningboard.menu.CPUFreq.160.build.f_cpu=160000000L
helber-learningboard.menu.CPUFreq.80=80MHz (WiFi/BT)
helber-learningboard.menu.CPUFreq.80.build.f_cpu=80000000L
helber-learningboard.menu.CPUFreq.40=40MHz (40MHz XTAL)
helber-learningboard.menu.CPUFreq.40.build.f_cpu=40000000L
helber-learningboard.menu.CPUFreq.26=26MHz (26MHz XTAL)
helber-learningboard.menu.CPUFreq.26.build.f_cpu=26000000L
helber-learningboard.menu.CPUFreq.20=20MHz (40MHz XTAL)
helber-learningboard.menu.CPUFreq.20.build.f_cpu=20000000L
helber-learningboard.menu.CPUFreq.13=13MHz (26MHz XTAL)
helber-learningboard.menu.CPUFreq.13.build.f_cpu=13000000L
helber-learningboard.menu.CPUFreq.10=10MHz (40MHz XTAL)
helber-learningboard.menu.CPUFreq.10.build.f_cpu=10000000L

helber-learningboard.menu.FlashMode.qio=QIO
helber-learningboard.menu.FlashMode.qio.build.flash_mode=dio
helber-learningboard.menu.FlashMode.qio.build.boot=qio
helber-learningboard.menu.FlashMode.dio=DIO
helber-learningboard.menu.FlashMode.dio.build.flash_mode=dio
helber-learningboard.menu.FlashMode.dio.build.boot=dio
helber-learningboard.menu.FlashMode.qout=QOUT
helber-learningboard.menu.FlashMode.qout.build.flash_mode=dout
helber-learningboard.menu.FlashMode.qout.build.boot=qout
helber-learningboard.menu.FlashMode.dout=DOUT
helber-learningboard.menu.FlashMode.dout.build.flash_mode=dout
helber-learningboard.menu.FlashMode.dout.build.boot=dout

helber-learningboard.menu.FlashFreq.80=80MHz
helber-learningboard.menu.FlashFreq.80.build.flash_freq=80m
helber-learningboard.menu.FlashFreq.40=40MHz
helber-learningboard.menu.FlashFreq.40.build.flash_freq=40m

helber-learningboard.menu.FlashSize.4M=4MB (32Mb)
helber-learningboard.menu.FlashSize.4M.build.flash_size=4MB
helber-learningboard.menu.FlashSize.8M=8MB (64Mb)
helber-learningboard.menu.FlashSize.8M.build.flash_size=8MB
helber-learningboard.menu.FlashSize.8M.build.partitions=default_8MB
helber-learningboard.menu.FlashSize.2M=2MB (16Mb)
helber-learningboard.menu.FlashSize.2M.build.flash_size=2MB
helber-learningboard.menu.FlashSize.2M.build.partitions=minimal
helber-learningboard.menu.FlashSize.16M=16MB (128Mb)
helber-learningboard.menu.FlashSize.16M.build.flash_size=16MB

helber-learningboard.menu.UploadSpeed.921600=921600
helber-learningboard.menu.UploadSpeed.921600.upload.speed=921600
helber-learningboard.menu.UploadSpeed.115200=115200
helber-learningboard.menu.UploadSpeed.115200.upload.speed=115200
helber-learningboard.menu.UploadSpeed.256000.windows=256000
helber-learningboard.menu.UploadSpeed.256000.upload.speed=256000
helber-learningboard.menu.UploadSpeed.230400.windows.upload.speed=256000
helber-learningboard.menu.UploadSpeed.230400=230400
helber-learningboard.menu.UploadSpeed.230400.upload.speed=230400
helber-learningboard.menu.UploadSpeed.460800.linux=460800
helber-learningboard.menu.UploadSpeed.460800.macosx=460800
helber-learningboard.menu.UploadSpeed.460800.upload.speed=460800
helber-learningboard.menu.UploadSpeed.512000.windows=512000
helber-learningboard.menu.UploadSpeed.512000.upload.speed=512000

helber-learningboard.menu.DebugLevel.none=None
helber-learningboard.menu.DebugLevel.none.build.code_debug=0
helber-learningboard.menu.DebugLevel.error=Error
helber-learningboard.menu.DebugLevel.error.build.code_debug=1
helber-learningboard.menu.DebugLevel.warn=Warn
helber-learningboard.menu.DebugLevel.warn.build.code_debug=2
helber-learningboard.menu.DebugLevel.info=Info
helber-learningboard.menu.DebugLevel.info.build.code_debug=3
helber-learningboard.menu.DebugLevel.debug=Debug
helber-learningboard.menu.DebugLevel.debug.build.code_debug=4
helber-learningboard.menu.DebugLevel.verbose=Verbose
helber-learningboard.menu.DebugLevel.verbose.build.code_debug=5

